In [1]:
import pandas as pd

In [2]:
pd.Series ([10,8,7,9])

0    10
1     8
2     7
3     9
dtype: int64

In [3]:
notas = pd.Series ([10,8,7,9])

Calcular média com Pandas

In [4]:
notas.mean()

8.5

Somar as Notas

In [5]:
notas.sum()

34

Desvio Padrão

In [6]:
notas.std()

1.2909944487358056

In [7]:
df = pd.DataFrame({"Alunos" :["Alfredo" , "Abel" , "Henrique", \
                             "Julia" , "Carlos"], 
                  "Faltas": [1, 8, 4, 0, 2],
                  "Prova" : [10, 9.8, 4.5, 8.5, 7.8]})

In [8]:
df

     Alunos  Faltas  Prova
0   Alfredo       1   10.0
1      Abel       8    9.8
2  Henrique       4    4.5
3     Julia       0    8.5
4    Carlos       2    7.8

In [9]:
df.iloc[0]

Alunos    Alfredo
Faltas          1
Prova        10.0
Name: 0, dtype: object

In [11]:
df.columns

Index(['Alunos', 'Faltas', 'Prova'], dtype='object')

In [12]:
df.dtypes

Alunos     object
Faltas      int64
Prova     float64
dtype: object

In [13]:
df

     Alunos  Faltas  Prova
0   Alfredo       1   10.0
1      Abel       8    9.8
2  Henrique       4    4.5
3     Julia       0    8.5
4    Carlos       2    7.8

In [17]:
df[df["Prova"] >8]

    Alunos  Faltas  Prova
0  Alfredo       1   10.0
1     Abel       8    9.8
3    Julia       0    8.5

O separador pode ser diferente dependendo do tipo de arquivo. O CSV por padrão utiliza vírgula, mas se fosse ; ou tabulação (\t) se faz necessário descrever o separador "sep" para que o Python e a Biblioteca Pandas possa entender a forma de exibição / montagem do arquivo lido.

In [18]:
apple = pd.read_csv("AAPL.csv", sep=",")

In [19]:
apple

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-07-18,191.779999,191.800003,189.929993,190.399994,187.545181,16393400
1,2018-07-19,189.690002,192.550003,189.690002,191.880005,189.003006,20286800
2,2018-07-20,191.779999,192.429993,190.169998,191.440002,188.569595,20676200
3,2018-07-23,190.679993,191.960007,189.559998,191.610001,188.737030,15989400
4,2018-07-24,192.449997,193.660004,192.050003,193.000000,190.106216,18697900
...,...,...,...,...,...,...,...
247,2019-07-12,202.449997,204.000000,202.199997,203.300003,203.300003,17595200
248,2019-07-15,204.089996,205.869995,204.000000,205.210007,205.210007,16947400
249,2019-07-16,204.589996,206.110001,203.500000,204.500000,204.500000,16866800
250,2019-07-17,204.050003,205.089996,203.270004,203.350006,203.350006,14088300
251,2019-07-18,204.000000,205.880005,203.699997,205.660004,205.660004,15724494

head - Exibir os primeiros registros ; tail , exibir os últimos registros

In [20]:
apple.head(10)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-07-18,191.779999,191.800003,189.929993,190.399994,187.545181,16393400
1,2018-07-19,189.690002,192.550003,189.690002,191.880005,189.003006,20286800
2,2018-07-20,191.779999,192.429993,190.169998,191.440002,188.569595,20676200
3,2018-07-23,190.679993,191.960007,189.559998,191.610001,188.737030,15989400
4,2018-07-24,192.449997,193.660004,192.050003,193.000000,190.106216,18697900
5,2018-07-25,193.059998,194.850006,192.429993,194.820007,191.898926,16709900
6,2018-07-26,194.610001,195.960007,193.610001,194.210007,191.298080,19076000
7,2018-07-27,194.990005,195.190002,190.100006,190.979996,188.116501,24024000
8,2018-07-30,191.899994,192.199997,189.070007,189.910004,187.062546,21029500
9,2018-07-31,190.300003,192.139999,189.339996,190.289993,187.436829,39373000

Verificando a média dos últimos sete dias

In [21]:
apple.tail(7)

,Date,Open,High,Low,Close,Adj Close,Volume
245,2019-07-10,201.850006,203.729996,201.559998,203.229996,203.229996,17897100
246,2019-07-11,203.309998,204.389999,201.710007,201.750000,201.750000,20191800
247,2019-07-12,202.449997,204.000000,202.199997,203.300003,203.300003,17595200
248,2019-07-15,204.089996,205.869995,204.000000,205.210007,205.210007,16947400
249,2019-07-16,204.589996,206.110001,203.500000,204.500000,204.500000,16866800
250,2019-07-17,204.050003,205.089996,203.270004,203.350006,203.350006,14088300
251,2019-07-18,204.000000,205.880005,203.699997,205.660004,205.660004,15724494

In [22]:
apple.tail(7)[["Adj Close"]].mean()

Adj Close    203.857145
dtype: float64

Com o comando acima, pudemos solicitar ao Pandas que determinasse a média do valor da coluna Adj Close dos últimos sete dias.

In [23]:
apple.describe()

,Open,High,Low,Close,Adj Close,Volume
count,252.000000,252.000000,252.000000,252.000000,252.000000,2.520000e+02
mean,192.479325,194.480715,190.559603,192.580437,191.239701,3.250815e+07
std,21.630732,21.758249,21.569369,21.644905,21.217154,1.387518e+07
min,143.979996,145.720001,142.000000,142.190002,141.039642,1.136200e+07
25%,174.872501,175.967499,173.747501,174.832496,174.111996,2.308030e+07
50%,194.279999,196.165001,192.599998,194.180000,193.582848,2.942395e+07
75%,209.312500,210.074997,206.832497,208.872498,206.713852,3.876472e+07
max,230.779999,233.470001,229.779999,232.070007,229.392090,9.624670e+07